app/api/client/project.rb

      def current_user
        warden = env["warden"]
        @current_user ||= warden.authenticate
      end
    end

    resource :projects do
      desc 'Return list of projects'
      get do
        #Project = ::Project.where(user_id: current_user.id)
        projects = current_user.projects
        present projects, with: Client::Entities::Project
      end
      #
      desc 'Create a new project'
      params do
        requires :name, type: String
      end
      post do
        #::Project.create!({
        #  user: current_user,
        #  name: params[:name]
        #})
        project = current_user.projects.create!(name: params[:name])
---
INSERT INTO `projects` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('test c new project 2', 1, '2021-01-06 10:42:10.698186', '2021-01-06 10:42:10.698186')

        requires :name, type: String, desc: 'Your project.'
      end
      put do
        project = current_user.projects.find(params[:id])
        #binding.pry
        #project = current_user.projects.find(params[:id]).update({
        project.update(name: params[:name])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 1 AND `projects`.`id` = 35 LIMIT 1
UPDATE `projects` SET `projects`.`name` = 'sasas', `projects`.`updated_at` = '2021-01-22 18:34:11.848719' WHERE `projects`.`id` = 35

        requires :id, type: Integer, desc: 'Project ID.'
      end
      delete do
        project = current_user.projects.find(params[:id]).destroy
---
DELETE FROM `projects` WHERE `projects`.`id` = 9
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 1 AND `projects`.`id` = 9 LIMIT 1