app/api/client/task.rb

          task = current_user.tasks.create!(name: params[:name], project_id: params[:project_id])
---
INSERT INTO `tasks` (`name`, `project_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Test add a task for 5th project', 5, 1, '2021-01-07 23:58:45.238053', '2021-01-07 23:58:45.238053')

          task = current_user.tasks.find(params[:id])
          task.update(name: params[:name], status: params[:status])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 12 LIMIT 1
UPDATE `tasks` SET `tasks`.`name` = 'Test update a task ', `tasks`.`updated_at` = '2021-01-08 11:41:39.723436' WHERE `tasks`.`id` = 9

          task = current_user.tasks.find(params[:id]).destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 19
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 19 LIMIT 1